package constructor

import constructor.russian.RussianLexicon

/**
 * @author peter
 */
class MorphologyTest extends GroovyTestCase {

  void testRechnik() {
    //Власти московской управы "Крылатское" намерены в течение месяца решить вопрос о сносе незаконных строений в
    //поселке "Речник".

    _ "власти", "-и власт-"
    _ "московской", "-ой московск-"
    _ "управы", "-ы управ-"
    _ "крылатское", "-ое крылатск-"
    _ "намерены", "-ы намерен-"
    _ "в", "в"
    _ "течение", "-е течени-"
    _ "месяца", "-а месяц"
    _ "решить", "-ть реши-"
    _ "вопрос", "вопрос"
    _ "о", "о"
    _ "сносе", "-е снос"
    _ "незаконных", "-ых незаконн-"
    _ "строений", "-ий строен-"
    _ "поселке", "-е поселк-"
    _ "речник", "речник"
  }

  def _(input, output) {
    assertEquals output.trim(), new Parser(new RussianLexicon()).parse(input).trim()
  }

}
